#pragma once

// Sea of Thieves (2.6.1) SDK

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

#include "SoT_Tales_structs.hpp"

namespace SDK
{
//---------------------------------------------------------------------------
//Classes
//---------------------------------------------------------------------------

// Class Tales.TaleQuestStep
// 0x0070 (0x0098 - 0x0028)
class UTaleQuestStep : public UObject
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0028(0x0060) MISSED OFFSET
	class UTaleQuestStepDesc*                          TaleStepDesc;                                             // 0x0088(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0090(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestService
// 0x0038 (0x0060 - 0x0028)
class UTaleQuestService : public UObject
{
public:
	unsigned char                                      UnknownData00[0x38];                                      // 0x0028(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestService"));
		return ptr;
	}

};


// Class Tales.TaleQuestServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestServiceDesc : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestStepDesc
// 0x0058 (0x0080 - 0x0028)
class UTaleQuestStepDesc : public UObject
{
public:
	bool                                               Fork;                                                     // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET
	TMap<struct FName, struct FQuestVariableAny>       PromotedPropertyVariables;                                // 0x0030(0x0050) (Edit, ZeroConstructor, EditConst)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestStepDesc"));
		return ptr;
	}

};


// Class Tales.TaleMigrationAction
// 0x0000 (0x0028 - 0x0028)
class UTaleMigrationAction : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleMigrationAction"));
		return ptr;
	}

};


// Class Tales.TaleQuestFramedStep
// 0x0040 (0x00D8 - 0x0098)
class UTaleQuestFramedStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0098(0x0008) MISSED OFFSET
	TArray<class UTaleQuestService*>                   Services;                                                 // 0x00A0(0x0010) (ZeroConstructor)
	class UTaleQuestFramedStepDesc*                    FrameDesc;                                                // 0x00B0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x10];                                      // 0x00B8(0x0010) MISSED OFFSET
	class UScriptStruct*                               StructForCollector;                                       // 0x00C8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UScriptStruct*                               LocalStructForCollector;                                  // 0x00D0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestFramedStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestFramedStepDesc
// 0x0020 (0x00A0 - 0x0080)
class UTaleQuestFramedStepDesc : public UTaleQuestStepDesc
{
public:
	TArray<class UTaleQuestServiceDesc*>               Services;                                                 // 0x0080(0x0010) (Edit, ExportObject, ZeroConstructor)
	class UScriptStruct*                               Variables;                                                // 0x0090(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FInlineUserDefinedStructDetails             GeneratedVariables;                                       // 0x0098(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestFramedStepDesc"));
		return ptr;
	}

};


// Class Tales.ContendedResourceComponent
// 0x0040 (0x0108 - 0x00C8)
class UContendedResourceComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x00C8(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.ContendedResourceComponent"));
		return ptr;
	}

};


// Class Tales.EnvQueryContext_TaleContextBase
// 0x0000 (0x0028 - 0x0028)
class UEnvQueryContext_TaleContextBase : public UEnvQueryContext
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.EnvQueryContext_TaleContextBase"));
		return ptr;
	}

};


// Class Tales.IslandTypeWeightsDataAsset
// 0x0010 (0x0038 - 0x0028)
class UIslandTypeWeightsDataAsset : public UDataAsset
{
public:
	TArray<struct FIslandTypeWeights>                  IslandTypeWeightsForDifficultyRanks;                      // 0x0028(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.IslandTypeWeightsDataAsset"));
		return ptr;
	}

};


// Class Tales.TaleQuestStepInterface
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestStepInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestStepInterface"));
		return ptr;
	}


	void Signal();
};


// Class Tales.SplineFootprintPathComponent
// 0x0020 (0x0660 - 0x0640)
class USplineFootprintPathComponent : public USplineComponent
{
public:
	class UMaterialInterface*                          DecalMaterial;                                            // 0x0640(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FSplineFootprintPathTool                    PathTool;                                                 // 0x0648(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0649(0x0003) MISSED OFFSET
	float                                              DecalYaw;                                                 // 0x064C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FVector                                     DecalUniformScale;                                        // 0x0650(0x000C) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x065C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.SplineFootprintPathComponent"));
		return ptr;
	}

};


// Class Tales.StartTallTaleConditionalStatTrigger
// 0x0000 (0x0030 - 0x0030)
class UStartTallTaleConditionalStatTrigger : public UConditionalStatsTriggerType
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.StartTallTaleConditionalStatTrigger"));
		return ptr;
	}

};


// Class Tales.TaleQuestArrayEntrySelectionStrategy
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestArrayEntrySelectionStrategy : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestArrayEntrySelectionStrategy"));
		return ptr;
	}

};


// Class Tales.FixedArrayEntrySelectionStrategy
// 0x0008 (0x0030 - 0x0028)
class UFixedArrayEntrySelectionStrategy : public UTaleQuestArrayEntrySelectionStrategy
{
public:
	int                                                IndexToSelect;                                            // 0x0028(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.FixedArrayEntrySelectionStrategy"));
		return ptr;
	}

};


// Class Tales.RandomArrayEntrySelectionStrategy
// 0x0000 (0x0028 - 0x0028)
class URandomArrayEntrySelectionStrategy : public UTaleQuestArrayEntrySelectionStrategy
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.RandomArrayEntrySelectionStrategy"));
		return ptr;
	}

};


// Class Tales.SequentialArrayEntrySelectionStrategy
// 0x0008 (0x0030 - 0x0028)
class USequentialArrayEntrySelectionStrategy : public UTaleQuestArrayEntrySelectionStrategy
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.SequentialArrayEntrySelectionStrategy"));
		return ptr;
	}

};


// Class Tales.TaleQuestCargoRunContract
// 0x0088 (0x00B0 - 0x0028)
class UTaleQuestCargoRunContract : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCompleted;                                              // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDelivered;                                              // 0x0048(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCollected;                                              // 0x0058(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	TArray<struct FTaleQuestCargoRunContractItem>      ItemsToCollect;                                           // 0x0068(0x0010) (Edit, BlueprintVisible, ZeroConstructor)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0078(0x0010) MISSED OFFSET
	class AActor*                                      DeliverToNPC;                                             // 0x0088(0x0008) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      CollectFromNPC;                                           // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x18];                                      // 0x0098(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestCargoRunContract"));
		return ptr;
	}

};


// Class Tales.TaleQuestCargoRunContractsService
// 0x0048 (0x00A8 - 0x0060)
class UTaleQuestCargoRunContractsService : public UTaleQuestService
{
public:
	TArray<class UTaleQuestCargoRunContract*>          Contracts;                                                // 0x0060(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x38];                                      // 0x0070(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestCargoRunContractsService"));
		return ptr;
	}


	class UTaleQuestCargoRunContract* GetContract(const struct FGuid& Guid);
	struct FGuid AddContract(TArray<class UClass*> InItems, class AActor* InCollectFromNPC, class AActor* InDeliverToNPC, int InTimeLimitInMinutes);
};


// Class Tales.TaleQuestCompoundStepInterface
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestCompoundStepInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestCompoundStepInterface"));
		return ptr;
	}

};


// Class Tales.TaleQuestIndexedFrame
// 0x0060 (0x0088 - 0x0028)
class UTaleQuestIndexedFrame : public UObject
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0028(0x0008) MISSED OFFSET
	class UTaleQuestForEachStepDescBase*               Desc;                                                     // 0x0030(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                Index;                                                    // 0x0038(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4C];                                      // 0x003C(0x004C) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestIndexedFrame"));
		return ptr;
	}

};


// Class Tales.TaleQuestMerchantContract
// 0x0060 (0x0088 - 0x0028)
class UTaleQuestMerchantContract : public UObject
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0028(0x0010) MISSED OFFSET
	struct FScriptMulticastDelegate                    OnCompleted;                                              // 0x0038(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnExpired;                                                // 0x0048(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnDelivered;                                              // 0x0058(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnCollected;                                              // 0x0068(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)
	struct FScriptMulticastDelegate                    OnAllocated;                                              // 0x0078(0x0010) (ZeroConstructor, InstancedReference, BlueprintAssignable)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestMerchantContract"));
		return ptr;
	}

};


// Class Tales.TaleQuestMerchantContractsService
// 0x0010 (0x0070 - 0x0060)
class UTaleQuestMerchantContractsService : public UTaleQuestService
{
public:
	TArray<class UTaleQuestMerchantContract*>          Contracts;                                                // 0x0060(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestMerchantContractsService"));
		return ptr;
	}


	class UTaleQuestMerchantContract* GetContract(const struct FGuid& Guid);
	struct FGuid AddContract(TArray<struct FTaleQuestDeliveryRequest> Requests, const struct FName& InDeliveryDestination, float InTimeLimit);
};


// Class Tales.TaleQuestImportFrame
// 0x0088 (0x00C0 - 0x0038)
class UTaleQuestImportFrame : public UTaleQuestRootFrame
{
public:
	unsigned char                                      UnknownData00[0x88];                                      // 0x0038(0x0088) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestImportFrame"));
		return ptr;
	}

};


// Class Tales.TaleQuestSelectorServiceBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestSelectorServiceBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestSelectorServiceBlueprintFunctionLibrary"));
		return ptr;
	}


	static void SetDebugVoyageSeed(int Seed);
	static void ResetVoyageDebugSeed();
};


// Class Tales.CutsceneResponsesTaleService
// 0x0030 (0x0090 - 0x0060)
class UCutsceneResponsesTaleService : public UTaleQuestService
{
public:
	TArray<class UCutsceneResponseCoordinator*>        TrackedResponseCoordinators;                              // 0x0060(0x0010) (ZeroConstructor)
	TArray<class UCutsceneResponseComponent*>          TrackedResponseComponents;                                // 0x0070(0x0010) (ExportObject, ZeroConstructor)
	TArray<class AActor*>                              ResponseRelevantActors;                                   // 0x0080(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.CutsceneResponsesTaleService"));
		return ptr;
	}


	void TrackResponseCoordinator(class UCutsceneResponseCoordinator* Coordinator);
	class UCutsceneResponseSheet* StartCutsceneResponseSheet(class AActor* TargetActor, const TScriptInterface<class UCutsceneResponsePlayerInterface>& CutsceneResponsePlayer, class UClass* ResponseSheetClass);
	void ClearAllActiveResponseSheets();
	void AddResponseSheetRelevantActor(class AActor* Actor);
};


// Class Tales.GameEventExclusionZoneTaleService
// 0x0028 (0x0088 - 0x0060)
class UGameEventExclusionZoneTaleService : public UTaleQuestService
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0060(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.GameEventExclusionZoneTaleService"));
		return ptr;
	}

};


// Class Tales.RewardGenTaleQuestService
// 0x0030 (0x0090 - 0x0060)
class URewardGenTaleQuestService : public UTaleQuestService
{
public:
	class UTaleQuestWeightedItemDescSpawnDataAsset*    GlobalSpawnData;                                          // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<int>                                        ValidSpawnData;                                           // 0x0068(0x0010) (ZeroConstructor)
	TArray<class UItemSpawnData*>                      ItemsToSpawn;                                             // 0x0078(0x0010) (ExportObject, ZeroConstructor)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0088(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.RewardGenTaleQuestService"));
		return ptr;
	}

};


// Class Tales.TaleQuestActorService
// 0x0310 (0x0370 - 0x0060)
class UTaleQuestActorService : public UTaleQuestService
{
public:
	TArray<struct FTrackedActorData>                   TrackedActors;                                            // 0x0060(0x0010) (ZeroConstructor)
	TArray<struct FCriticalActorDelegateData>          CriticalActors;                                           // 0x0070(0x0010) (ZeroConstructor)
	TArray<struct FSnapshottedActorData>               SnapshottedActors;                                        // 0x0080(0x0010) (ZeroConstructor)
	class UTaleQuestActorServiceDesc*                  Desc;                                                     // 0x0090(0x0008) (ZeroConstructor, IsPlainOldData)
	class APhasedClusterRoot*                          PhasedClusterRoot;                                        // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	TArray<struct FPhasedActor>                        PhasedActors;                                             // 0x00A0(0x0010) (ZeroConstructor)
	TArray<struct FPhasedItem>                         PhasedItems;                                              // 0x00B0(0x0010) (ZeroConstructor)
	struct FText                                       CriticalActorHandedInByAnotherCrewFailureMessage;         // 0x00C0(0x0038)
	unsigned char                                      UnknownData00[0x278];                                     // 0x00F8(0x0278) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestActorService"));
		return ptr;
	}

};


// Class Tales.TaleQuestCheckpointService
// 0x0048 (0x00A8 - 0x0060)
class UTaleQuestCheckpointService : public UTaleQuestService
{
public:
	class UTaleQuestCheckpointServiceDesc*             Desc;                                                     // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x40];                                      // 0x0068(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestCheckpointService"));
		return ptr;
	}

};


// Class Tales.TaleQuestEQSService
// 0x00C8 (0x0128 - 0x0060)
class UTaleQuestEQSService : public UTaleQuestService
{
public:
	unsigned char                                      UnknownData00[0xC8];                                      // 0x0060(0x00C8) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestEQSService"));
		return ptr;
	}

};


// Class Tales.TaleQuestInteractionPreventionService
// 0x0018 (0x0078 - 0x0060)
class UTaleQuestInteractionPreventionService : public UTaleQuestService
{
public:
	TArray<class AActor*>                              TrackedInteractionActors;                                 // 0x0060(0x0010) (ZeroConstructor)
	class UTaleQuestInteractionPreventionServiceDesc*  Desc;                                                     // 0x0070(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestInteractionPreventionService"));
		return ptr;
	}


	void PreventInteractionWithTargetActor(class AActor* Actor);
	void EnableInteractionWithTargetActor(class AActor* Actor);
};


// Class Tales.TaleQuestSelectorService
// 0x0028 (0x0088 - 0x0060)
class UTaleQuestSelectorService : public UTaleQuestService
{
public:
	class UTaleQuestSelectorServiceDesc*               Desc;                                                     // 0x0060(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0068(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestSelectorService"));
		return ptr;
	}


	int GetRandomIntegerInRange(int Minimum, int Maximum);
	float GetRandomFloatInRange(float Minimum, float Maximum);
};


// Class Tales.TaleQuestToggleInteractionDescriptionService
// 0x0058 (0x00B8 - 0x0060)
class UTaleQuestToggleInteractionDescriptionService : public UTaleQuestService
{
public:
	TMap<class AActor*, TEnumAsByte<ETaleInteractionState>> TrackedInteractionActors;                                 // 0x0060(0x0050) (ZeroConstructor)
	class UTaleQuestToggleInteractionDescriptionServiceDesc* Desc;                                                     // 0x00B0(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestToggleInteractionDescriptionService"));
		return ptr;
	}


	void TargetActorInteractionToEnable(class AActor* Actor);
	void TargetActorInteractionToDisable(class AActor* Actor);
};


// Class Tales.TaleResourceBrokerService
// 0x0048 (0x00A8 - 0x0060)
class UTaleResourceBrokerService : public UTaleQuestService
{
public:
	TScriptInterface<class UContendedResourceServiceInterface> ContendedResourceService;                                 // 0x0060(0x0010) (ZeroConstructor, IsPlainOldData)
	TScriptInterface<class UWorldResourceRegistryInterface> ResourceRegistry;                                         // 0x0070(0x0010) (ZeroConstructor, IsPlainOldData)
	TArray<struct FMigrationActionPair>                MigrationActions;                                         // 0x0080(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x18];                                      // 0x0090(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleResourceBrokerService"));
		return ptr;
	}

};


// Class Tales.CutsceneResponsesTaleServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UCutsceneResponsesTaleServiceDesc : public UTaleQuestServiceDesc
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.CutsceneResponsesTaleServiceDesc"));
		return ptr;
	}

};


// Class Tales.GameEventExclusionZoneTaleServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UGameEventExclusionZoneTaleServiceDesc : public UTaleQuestServiceDesc
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.GameEventExclusionZoneTaleServiceDesc"));
		return ptr;
	}

};


// Class Tales.RewardGenTaleQuestServiceDesc
// 0x0008 (0x0030 - 0x0028)
class URewardGenTaleQuestServiceDesc : public UTaleQuestServiceDesc
{
public:
	class UTaleQuestWeightedItemDescSpawnDataAsset*    SpawnData;                                                // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.RewardGenTaleQuestServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestActorServiceDesc
// 0x0008 (0x0030 - 0x0028)
class UTaleQuestActorServiceDesc : public UTaleQuestServiceDesc
{
public:
	class UClass*                                      ItemLostFailureRunnable;                                  // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestActorServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestCargoRunContractsServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestCargoRunContractsServiceDesc : public UTaleQuestServiceDesc
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestCargoRunContractsServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestEQSServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestEQSServiceDesc : public UTaleQuestServiceDesc
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestEQSServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestInteractionPreventionServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestInteractionPreventionServiceDesc : public UTaleQuestServiceDesc
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestInteractionPreventionServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestMerchantContractsServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestMerchantContractsServiceDesc : public UTaleQuestServiceDesc
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestMerchantContractsServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestSelectorServiceDesc
// 0x0000 (0x0028 - 0x0028)
class UTaleQuestSelectorServiceDesc : public UTaleQuestServiceDesc
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestSelectorServiceDesc"));
		return ptr;
	}

};


// Class Tales.TaleQuestToggleInteractionDescriptionServiceDesc
// 0x0008 (0x0030 - 0x0028)
class UTaleQuestToggleInteractionDescriptionServiceDesc : public UTaleQuestServiceDesc
{
public:
	bool                                               ResetDisabledInteractsOnEnd;                              // 0x0028(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               ResetEnabledInteractsOnEnd;                               // 0x0029(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x002A(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestToggleInteractionDescriptionServiceDesc"));
		return ptr;
	}

};


// Class Tales.ActorRadiusTrackerStep
// 0x0038 (0x00D0 - 0x0098)
class UActorRadiusTrackerStep : public UTaleQuestStep
{
public:
	class UActorRadiusTrackerStepDesc*                 Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	class AActor*                                      TargetActor;                                              // 0x00A0(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x00A8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.ActorRadiusTrackerStep"));
		return ptr;
	}

};


// Class Tales.AddGameEventExclusionZoneStep
// 0x0008 (0x00A0 - 0x0098)
class UAddGameEventExclusionZoneStep : public UTaleQuestStep
{
public:
	class UAddGameEventExclusionZoneStepDesc*          Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.AddGameEventExclusionZoneStep"));
		return ptr;
	}

};


// Class Tales.CallObjectFunctionStep
// 0x0000 (0x0098 - 0x0098)
class UCallObjectFunctionStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.CallObjectFunctionStep"));
		return ptr;
	}

};


// Class Tales.DebugTaleAddInstancedLevelStep
// 0x0038 (0x00D0 - 0x0098)
class UDebugTaleAddInstancedLevelStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0098(0x0008) MISSED OFFSET
	class UDebugTaleAddInstancedLevelStepDesc*         StepDesc;                                                 // 0x00A0(0x0008) (ZeroConstructor, IsPlainOldData)
	class FString                                      InstancedLevelPath;                                       // 0x00A8(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData01[0x18];                                      // 0x00B8(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.DebugTaleAddInstancedLevelStep"));
		return ptr;
	}

};


// Class Tales.DebugTaleAddInstancedLevelStepDesc
// 0x0040 (0x00C0 - 0x0080)
class UDebugTaleAddInstancedLevelStepDesc : public UTaleQuestStepDesc
{
public:
	struct FText                                       InstancedLevelKeyword;                                    // 0x0080(0x0038) (Edit)
	uint32_t                                           InstancedLevelIndex;                                      // 0x00B8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.DebugTaleAddInstancedLevelStepDesc"));
		return ptr;
	}

};


// Class Tales.DestroySpawnedActorStep
// 0x0000 (0x0098 - 0x0098)
class UDestroySpawnedActorStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.DestroySpawnedActorStep"));
		return ptr;
	}

};


// Class Tales.DoEQSQueryStep
// 0x0010 (0x00A8 - 0x0098)
class UDoEQSQueryStep : public UTaleQuestStep
{
public:
	class UDoEQSQueryStepDesc*                         Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UTaleQuestEQSService*                        CachedTaleEQSService;                                     // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.DoEQSQueryStep"));
		return ptr;
	}

};


// Class Tales.EnableInteractionWithActorStep
// 0x0000 (0x0098 - 0x0098)
class UEnableInteractionWithActorStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.EnableInteractionWithActorStep"));
		return ptr;
	}

};


// Class Tales.FindItemInCollectorsChestStep
// 0x0000 (0x0098 - 0x0098)
class UFindItemInCollectorsChestStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.FindItemInCollectorsChestStep"));
		return ptr;
	}

};


// Class Tales.FindNamedPointStep
// 0x0000 (0x0098 - 0x0098)
class UFindNamedPointStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.FindNamedPointStep"));
		return ptr;
	}

};


// Class Tales.FindNamedPointAsVectorStep
// 0x0000 (0x0098 - 0x0098)
class UFindNamedPointAsVectorStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.FindNamedPointAsVectorStep"));
		return ptr;
	}

};


// Class Tales.FindNamedPointAsTransformStep
// 0x0000 (0x0098 - 0x0098)
class UFindNamedPointAsTransformStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.FindNamedPointAsTransformStep"));
		return ptr;
	}

};


// Class Tales.ForceCannonLoadStep
// 0x0040 (0x00D8 - 0x0098)
class UForceCannonLoadStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0098(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.ForceCannonLoadStep"));
		return ptr;
	}

};


// Class Tales.GenerateDigLocationInRadiusStep
// 0x0080 (0x0118 - 0x0098)
class UGenerateDigLocationInRadiusStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x80];                                      // 0x0098(0x0080) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.GenerateDigLocationInRadiusStep"));
		return ptr;
	}

};


// Class Tales.GetActorOfInterestStep
// 0x0000 (0x0098 - 0x0098)
class UGetActorOfInterestStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.GetActorOfInterestStep"));
		return ptr;
	}

};


// Class Tales.GetVoyageDifficultyFromRankStep
// 0x0028 (0x00C0 - 0x0098)
class UGetVoyageDifficultyFromRankStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x28];                                      // 0x0098(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.GetVoyageDifficultyFromRankStep"));
		return ptr;
	}

};


// Class Tales.InvokeDamageStep
// 0x0000 (0x0098 - 0x0098)
class UInvokeDamageStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.InvokeDamageStep"));
		return ptr;
	}

};


// Class Tales.LinkEQSContextWithVariableStep
// 0x0008 (0x00A0 - 0x0098)
class ULinkEQSContextWithVariableStep : public UTaleQuestStep
{
public:
	class ULinkEQSContextWithVariableStepDesc*         Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.LinkEQSContextWithVariableStep"));
		return ptr;
	}

};


// Class Tales.LoadSequencerAnimationStep
// 0x0018 (0x00B0 - 0x0098)
class ULoadSequencerAnimationStep : public UTaleQuestStep
{
public:
	class ULoadSequencerAnimationStepDesc*             StepDesc;                                                 // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASequencerCutSceneActor*                     SequencerCutSceneActor;                                   // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class AActor*                                      TargetToSpawnActor;                                       // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.LoadSequencerAnimationStep"));
		return ptr;
	}

};


// Class Tales.OverrideManagedActorStateStep
// 0x0000 (0x0098 - 0x0098)
class UOverrideManagedActorStateStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.OverrideManagedActorStateStep"));
		return ptr;
	}

};


// Class Tales.ParticipantRadiusTrackerStep
// 0x0020 (0x00B8 - 0x0098)
class UParticipantRadiusTrackerStep : public UTaleQuestStep
{
public:
	class UParticipantRadiusTrackerStepDesc*           Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x18];                                      // 0x00A0(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.ParticipantRadiusTrackerStep"));
		return ptr;
	}

};


// Class Tales.PlaySequencerAnimationOnCutsceneActorStep
// 0x0030 (0x00C8 - 0x0098)
class UPlaySequencerAnimationOnCutsceneActorStep : public UTaleQuestStep
{
public:
	class UPlaySequencerAnimationOnCutsceneActorStepDesc* StepDesc;                                                 // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASequencerCutSceneActor*                     SequencerCutSceneActor;                                   // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	TArray<struct FPossessableSequence>                PossessableSequences;                                     // 0x00A8(0x0010) (ZeroConstructor)
	unsigned char                                      UnknownData00[0x10];                                      // 0x00B8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.PlaySequencerAnimationOnCutsceneActorStep"));
		return ptr;
	}

};


// Class Tales.PlaySequencerAnimationStep
// 0x0038 (0x00D0 - 0x0098)
class UPlaySequencerAnimationStep : public UTaleQuestStep
{
public:
	class UPlaySequencerAnimationStepDesc*             StepDesc;                                                 // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	class ASequencerCutSceneActor*                     SequencerCutSceneActor;                                   // 0x00A0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x00A8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.PlaySequencerAnimationStep"));
		return ptr;
	}

};


// Class Tales.PreventInteractionWithActorStep
// 0x0000 (0x0098 - 0x0098)
class UPreventInteractionWithActorStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.PreventInteractionWithActorStep"));
		return ptr;
	}

};


// Class Tales.ProvokeHitReactionStep
// 0x0000 (0x0098 - 0x0098)
class UProvokeHitReactionStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.ProvokeHitReactionStep"));
		return ptr;
	}

};


// Class Tales.RemoveGameEventExclusionZoneStep
// 0x0008 (0x00A0 - 0x0098)
class URemoveGameEventExclusionZoneStep : public UTaleQuestStep
{
public:
	class URemoveGameEventExclusionZoneStepDesc*       Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.RemoveGameEventExclusionZoneStep"));
		return ptr;
	}

};


// Class Tales.SelectNamedPointStep
// 0x0000 (0x0098 - 0x0098)
class USelectNamedPointStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.SelectNamedPointStep"));
		return ptr;
	}

};


// Class Tales.SetEQSNamedContextStep
// 0x0008 (0x00A0 - 0x0098)
class USetEQSNamedContextStep : public UTaleQuestStep
{
public:
	class USetEQSNamedContextStepDesc*                 Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.SetEQSNamedContextStep"));
		return ptr;
	}

};


// Class Tales.SpawnLayerStep
// 0x0018 (0x00B0 - 0x0098)
class USpawnLayerStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x18];                                      // 0x0098(0x0018) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.SpawnLayerStep"));
		return ptr;
	}

};


// Class Tales.SpawnPhasedActorWithTransformStep
// 0x0058 (0x00F0 - 0x0098)
class USpawnPhasedActorWithTransformStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x58];                                      // 0x0098(0x0058) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.SpawnPhasedActorWithTransformStep"));
		return ptr;
	}

};


// Class Tales.SpawnPhasedItemStep
// 0x0000 (0x0098 - 0x0098)
class USpawnPhasedItemStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.SpawnPhasedItemStep"));
		return ptr;
	}

};


// Class Tales.StartSuppressingCutsceneResponsesStep
// 0x0000 (0x0098 - 0x0098)
class UStartSuppressingCutsceneResponsesStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.StartSuppressingCutsceneResponsesStep"));
		return ptr;
	}

};


// Class Tales.StopSuppressingCutsceneResponsesStep
// 0x0000 (0x0098 - 0x0098)
class UStopSuppressingCutsceneResponsesStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.StopSuppressingCutsceneResponsesStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestAddToArrayStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestAddToArrayStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestAddToArrayStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestArrayAppendStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestArrayAppendStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestArrayAppendStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestArrayContainsStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestArrayContainsStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestArrayContainsStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestArrayUnionStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestArrayUnionStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestArrayUnionStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestAwaitEventStep
// 0x0048 (0x00E0 - 0x0098)
class UTaleQuestAwaitEventStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x48];                                      // 0x0098(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestAwaitEventStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestChooseIslandFromWeightsStep
// 0x0068 (0x0100 - 0x0098)
class UTaleQuestChooseIslandFromWeightsStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x60];                                      // 0x0098(0x0060) MISSED OFFSET
	class UIslandTypeWeightsDataAsset*                 IslandTypeWeights;                                        // 0x00F8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestChooseIslandFromWeightsStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestClearTaleProposalsStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestClearTaleProposalsStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestClearTaleProposalsStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestCrewTaskStep
// 0x0038 (0x00D0 - 0x0098)
class UTaleQuestCrewTaskStep : public UTaleQuestStep
{
public:
	TScriptInterface<class UTaleQuestStepInterface>    Task;                                                     // 0x0098(0x0010) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x00A8(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestCrewTaskStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestDisableInteractionStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestDisableInteractionStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestDisableInteractionStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestEmissaryCompanyActionRewardBoostStep
// 0x0008 (0x00A0 - 0x0098)
class UTaleQuestEmissaryCompanyActionRewardBoostStep : public UTaleQuestStep
{
public:
	class UTaleQuestEmissaryCompanyActionRewardBoostStepDesc* Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestEmissaryCompanyActionRewardBoostStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestEnableInteractionStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestEnableInteractionStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestEnableInteractionStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestFireEventStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestFireEventStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestFireEventStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestForEachStepBase
// 0x0010 (0x00A8 - 0x0098)
class UTaleQuestForEachStepBase : public UTaleQuestStep
{
public:
	TArray<struct FBodyFramePair>                      Bodies;                                                   // 0x0098(0x0010) (ZeroConstructor, Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestForEachStepBase"));
		return ptr;
	}

};


// Class Tales.TaleQuestForEachAnyStep
// 0x0000 (0x00A8 - 0x00A8)
class UTaleQuestForEachAnyStep : public UTaleQuestForEachStepBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestForEachAnyStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestForEachSequential
// 0x0040 (0x00E8 - 0x00A8)
class UTaleQuestForEachSequential : public UTaleQuestForEachStepBase
{
public:
	class UTaleQuestIndexedFrame*                      Frame;                                                    // 0x00A8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x38];                                      // 0x00B0(0x0038) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestForEachSequential"));
		return ptr;
	}

};


// Class Tales.TaleQuestForEachUnionStep
// 0x0000 (0x00A8 - 0x00A8)
class UTaleQuestForEachUnionStep : public UTaleQuestForEachStepBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestForEachUnionStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestGetCollectionItemCountStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestGetCollectionItemCountStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestGetCollectionItemCountStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestGetParticipatingCrewsStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestGetParticipatingCrewsStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestGetParticipatingCrewsStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestGrantRewardStep
// 0x0040 (0x00D8 - 0x0098)
class UTaleQuestGrantRewardStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0098(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestGrantRewardStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestPermanentPromptStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestPermanentPromptStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestPermanentPromptStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestPersistentForEachCrewTaskStep
// 0x0058 (0x00F0 - 0x0098)
class UTaleQuestPersistentForEachCrewTaskStep : public UTaleQuestStep
{
public:
	class UTaleQuestPersistentForEachCrewTaskStepDesc* StepDesc;                                                 // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x50];                                      // 0x00A0(0x0050) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestPersistentForEachCrewTaskStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestSelectEntryFromArrayStep
// 0x0040 (0x00D8 - 0x0098)
class UTaleQuestSelectEntryFromArrayStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x40];                                      // 0x0098(0x0040) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestSelectEntryFromArrayStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestShipDiveStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestShipDiveStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestShipDiveStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestShipSurfaceStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestShipSurfaceStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestShipSurfaceStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestStartCameraFadeStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestStartCameraFadeStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestStartCameraFadeStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestStructStepBase
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestStructStepBase : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestStructStepBase"));
		return ptr;
	}

};


// Class Tales.TaleQuestBreakStructStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestBreakStructStep : public UTaleQuestStructStepBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestBreakStructStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestMakeStructStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestMakeStructStep : public UTaleQuestStructStepBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestMakeStructStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestToggleAmbientMigrationForServerStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestToggleAmbientMigrationForServerStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestToggleAmbientMigrationForServerStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestUpdateCheckpointStep
// 0x0000 (0x0098 - 0x0098)
class UTaleQuestUpdateCheckpointStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestUpdateCheckpointStep"));
		return ptr;
	}

};


// Class Tales.TaleQuestWaitForHandInStep
// 0x0010 (0x00A8 - 0x0098)
class UTaleQuestWaitForHandInStep : public UTaleQuestStep
{
public:
	class UTaleQuestWaitForHandInStepDesc*             Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00A0(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TaleQuestWaitForHandInStep"));
		return ptr;
	}

};


// Class Tales.TrackResponseCoordinatorStep
// 0x0008 (0x00A0 - 0x0098)
class UTrackResponseCoordinatorStep : public UTaleQuestStep
{
public:
	class UTrackResponseCoordinatorStepDesc*           StepDesc;                                                 // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.TrackResponseCoordinatorStep"));
		return ptr;
	}

};


// Class Tales.VisualiseLoggerEQSResultsTaleStep
// 0x0000 (0x0098 - 0x0098)
class UVisualiseLoggerEQSResultsTaleStep : public UTaleQuestStep
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.VisualiseLoggerEQSResultsTaleStep"));
		return ptr;
	}

};


// Class Tales.WaitForActorOfInterestToUnregisterStep
// 0x0078 (0x0110 - 0x0098)
class UWaitForActorOfInterestToUnregisterStep : public UTaleQuestStep
{
public:
	class UWaitForActorOfInterestToUnregisterStepDesc* Desc;                                                     // 0x0098(0x0008) (ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x70];                                      // 0x00A0(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.WaitForActorOfInterestToUnregisterStep"));
		return ptr;
	}

};


// Class Tales.WaitForHealthToReachFractionStep
// 0x0070 (0x0108 - 0x0098)
class UWaitForHealthToReachFractionStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0x70];                                      // 0x0098(0x0070) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.WaitForHealthToReachFractionStep"));
		return ptr;
	}

};


// Class Tales.WaitForItemPickupStep
// 0x00B0 (0x0148 - 0x0098)
class UWaitForItemPickupStep : public UTaleQuestStep
{
public:
	unsigned char                                      UnknownData00[0xB0];                                      // 0x0098(0x00B0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.WaitForItemPickupStep"));
		return ptr;
	}

};


// Class Tales.ActorRadiusTrackerStepDesc
// 0x0070 (0x00F0 - 0x0080)
class UActorRadiusTrackerStepDesc : public UTaleQuestStepDesc
{
public:
	struct FQuestVariableActor                         TargetActor;                                              // 0x0080(0x0020) (Edit)
	float                                              DurationBetweenChecks;                                    // 0x00A0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET
	struct FQuestVariableVector                        Location;                                                 // 0x00A8(0x0020) (Edit)
	float                                              Radius;                                                   // 0x00C8(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET
	struct FQuestVariableBool                          ActorInsideRadius;                                        // 0x00D0(0x0020) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.ActorRadiusTrackerStepDesc"));
		return ptr;
	}

};


// Class Tales.AddGameEventExclusionZoneStepDesc
// 0x0028 (0x00A8 - 0x0080)
class UAddGameEventExclusionZoneStepDesc : public UTaleQuestStepDesc
{
public:
	float                                              Radius;                                                   // 0x0080(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0084(0x0004) MISSED OFFSET
	struct FQuestVariableVector                        Location;                                                 // 0x0088(0x0020) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindObject<UClass>(_xor_("Class Tales.AddGameEventExclusionZoneStepDesc"));
		return ptr;
	}

};


// Class Tales.CallObjectFunctionStepDesc
// 0x0068 (0x00E8 - 0x0080)
class UCallObjectFunctionStepDesc : public UTaleQuestStepDesc
{
public:
	class UObject*                                     Target;                                                   // 0x0080(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FClassFunctionSelectionType                 Function;                                                 // 0x0088(0x0010) (Edit)
